pabigot/FatFs/lpc23xx/disp.c
/*------------------------------------------------------------------------/
/  Display control module for SSD1339/SSD1355
/-------------------------------------------------------------------------/
/
/  Copyright (C) 2011, ChaN, all right reserved.
/
/ * This software is a free software and there is NO WARRANTY.
/ * No restriction on use. You can use, modify and redistribute it for
/   personal, non-profit or commercial products UNDER YOUR RESPONSIBILITY.
/ * Redistributions of source code must retain the above copyright notice.
/
/-------------------------------------------------------------------------*/

#include <string.h>
#include "LPC2300.h"
#include "disp.h"


#if _USE_FILE_LOADER
#include "xprintf.h"
#include "ff.h"
#include "interrupt.h"
#include "sound.h"
#include "uart23xx.h"
#include "tjpgd.h"
#endif

#define USE_DBCS	1	/* 0:ANK only, 1:Enable kanji chars */

#define	DISP_TYPE	(FIO4PIN1 & _BV(7))	/* P4.15(Module type): H=SSD1339, L=SSD1355 */

#define DISP_DAT	FIO4PIN0
#define DISP_WR_L()	FIO4CLR1 = _BV(1)
#define DISP_WR_H()	FIO4SET1 = _BV(1)
#define DISP_CD_H()	FIO4SET1 = _BV(3)
#define DISP_CD_L()	FIO4CLR1 = _BV(3)
#define DISP_RES_L()	FIO4CLR1 = _BV(4)
#define DISP_RES_H()	FIO4SET1 = _BV(4)

#define	CMD_WRB(d)	{ DISP_DAT = (d); DISP_CD_L(); DISP_WR_L(); DISP_WR_H(); DISP_CD_H(); }	/* Write a command to the OLED */
#define	DATA_WRB(d)	{ DISP_DAT = (d); DISP_WR_L(); DISP_WR_H(); }	/* Write a byte to the OLED */
#define	DATA_WPX(d)	{ DATA_WRB((d)>>8); DATA_WRB(d); }				/* Write a pixel to the OLED */



static int MaskT, MaskL, MaskR, MaskB;	/* Drawing mask */
static int LocX, LocY;			/* Current dot position */
static uint32_t ChrColor;		/* Current character color ((bg << 16) + fg) */
static const uint8_t *FontS;	/* Current font (ANK) */
#if USE_DBCS
static const uint8_t *FontD;	/* Current font (Kanji) */
static uint8_t Sjis;			/* Sjis leading byte */
#endif

#if _USE_FILE_LOADER
volatile long TmrFrm;			/* Timer (increased 1000 every 1ms) */
#endif

/* Import FONTX2 files as byte array */
IMPORT_BIN(".rodata", "rc/FONT24S.FNT", FontH24);			/* const uint8_t FontH24[] */
IMPORT_BIN(".rodata", "rc/mplfont/MPLHN10X.FNT", FontH10);	/* const uint8_t FontH10[] */
IMPORT_BIN(".rodata", "rc/mplfont/MPLZN10X.FNT", FontZ10);	/* const uint8_t FontZ10[] */


static
WORD ld_word (const BYTE* ptr)	/*	 Load a 2-byte little-endian word */
{
	WORD rv;

	rv = ptr[1];
	rv = rv << 8 | ptr[0];
	return rv;
}

static
DWORD ld_dword (const BYTE* ptr)	/* Load a 4-byte little-endian word */
{
	DWORD rv;

	rv = ptr[3];
	rv = rv << 8 | ptr[2];
	rv = rv << 8 | ptr[1];
	rv = rv << 8 | ptr[0];
	return rv;
}


/*-----------------------------------------------------*/
/* Set rectangular area to be transferred              */

static
void disp_setrect (
	int left,		/* Left end (0..127) */
	int right,		/* Right end (0..127, >= left) */
	int top,		/* Top end (0..127) */
	int bottom		/* Bottom end (0..127, >= top) */
)
{
	CMD_WRB(DISP_TYPE ? 0x15 : 0x2A);	/* Set H range */
	DATA_WRB(left); DATA_WRB(right); 

	CMD_WRB(DISP_TYPE ? 0x75 : 0x2B);	/* Set V range */
	DATA_WRB(top); DATA_WRB(bottom); 

	CMD_WRB(DISP_TYPE ? 0x5C : 0x2C);	/* Ready to receive pixel data */
}



/*-----------------------------------------------------*/
/* Initialize display module (SSD1339 or SSD1355)      */

void disp_init (void)
{
	static const BYTE ssd1339[] = {
		2, 0xA0, 0x74,		// Set Re-map / Color Depth (64K color, COM split, COM remap, 8-bit, Color remap, Non column address remap, Hotizontal increment)
		2, 0xA1, 0x00,		// Set display start line (0)
		2, 0xA2, 0x80,		// Set display offset (128)
		1, 0xA6,			// Normal display
		2, 0xAD, 0x8E,		// Set Master Configuration (DC-DC off & external VcomH voltage & external pre-charge voltage)
		2, 0xB0, 0x05,		// Power saving mode
		2, 0xB1, 0x11, 		// Set pre & dis_charge (pre=1h dis=1h)
		2, 0xB3, 0x61,		// clock & frequency (clock=Divser+2 frequency=6)
		4, 0xBB, 0x1C, 0x1C, 0x1C,	// Set pre-charge voltage of color A B C
		2, 0xBE, 0x1F,		// Set VcomH
	//	4, 0xC1, 0xAA, 0xB4, 0xC8,	// Set contrast current for A B C
	//	2, 0xC7, 0x0F,		// Set master contrast
		2, 0xCA, 0x7F,		// Duty
		0,
		0xAF				// Display on
	};
	 static const BYTE ssd1355[] = {
		2, 0xFD, 0xB3,		// Unlock all commands
		1, 0x11,			// Sleep out
		2, 0x3A, 0x05,		// Interface Pixel Format (64K color)
		2, 0xD2, 0xA1,		// Set display clock divider (Fosc=10, Dclkdiv=2)
		2, 0xC8, 0x00,		// Set display offset
		3, 0x36, 0x88, 0x01,// MADCTRL
		2, 0xD3, 0x04,		// Set VcomH (0.8 Vcc)
		2, 0xCA, 0x7F,		// Set MUX ratio (128 mux)
		2, 0xCD, 0x74,		// Set precharge length (9 DCLK + 7 DCLK)
		2, 0xCE, 0x07,		// Set second precharge period (7 DCLK)
		2, 0xCF, 0x02,		// Set second precharge speed (Normal)
		2, 0xBA, 0x40,		// Set contrast current for A (R = 0x40)
		2, 0xBB, 0x48,		// Set contrast current for B (G = 0x50)
		2, 0xBC, 0x46,		// Set contrast current for C (B = 0x4E)
		2, 0xBD, 0x08,		// Set first precharge voltage
		97, 0xBE, 0, 0, 0, 1, 3, 4, 6, 8, 10, 13, 15, 18, 21, 25, 28, 32, 36, 40, 45, 50, 54, 59, 65, 70, 76, 82, 88, 94, 100, 107, 113, 120, 0, 0, 0, 1, 3, 4, 6, 8, 10, 13, 15, 18, 21, 25, 28, 32, 36, 40, 45, 50, 54, 59, 65, 70, 76, 82, 88, 94, 100, 107, 113, 120, 0, 0, 0, 1, 3, 4, 6, 8, 10, 13, 15, 18, 21, 25, 28, 32, 36, 40, 45, 50, 54, 59, 65, 70, 76, 82, 88, 94, 100, 107, 113, 120, // Set gamma table
		0,
		0x13,			// Display on
	};
	const BYTE *p;
	BYTE cmd;
	int n, i;


	/* Initialize display module control port */
	FIO4PINL = 0x1FFF;		/* P4L: TYPE|-|-|RES#|D/C#|CS#|WR#|RD#|D7|D6|D5|D4|D3|D2|D1|D0 */
	FIO4DIRL = 0x1FFF;
	FIO4SET1 = 0x01;	/* RD=H (fixed) */
	FIO4CLR1 = 0x04;	/* CS=L (fixed) */

	/* Reset display module */
	DISP_WR_H();
	DISP_RES_L();
	for (TmrFrm = 0; TmrFrm < 20000; ) ;	/* 20ms */
	DISP_RES_H();
	for (TmrFrm = 0; TmrFrm < 20000; ) ;	/* 20ms */

	/* Send initialization data */
	p = DISP_TYPE ? ssd1339 : ssd1355;
	while ((n = *p++) != 0) {
		cmd = *p++; n--;
		CMD_WRB(cmd);
		for (i = 0; i < n; i++) DATA_WRB(*p++);
	}

	/* Clear screen and Display ON */
	disp_setmask(0, DISP_XS - 1, 0, DISP_YS - 1);
	disp_rectfill(0, DISP_XS - 1, 0, DISP_YS - 1, 0x0000);
	CMD_WRB(*p);	/* Display ON */

	/* Register text fonts */
	disp_font_face(FontH10);	/* ANK font */
	disp_font_face(FontZ10);	/* Kanji font */
}



/*-----------------------------------------------------*/
/* Set active drawing area                             */
/*-----------------------------------------------------*/
/* The mask feature affects only graphics functions    */

