pabigot/FatFs/lpc23xx/disp.c
void disp_setmask (
	int left,		/* Left end of active window (0..DISP_XS-1) */
	int right,		/* Right end of active window (0..DISP_XS-1, >=left) */
	int top,		/* Top end of active window (0..DISP_YS-1) */
	int bottom		/* Bottom end of active window (0..DISP_YS-1, >=top) */
)
{
	if (left >= 0 && right < DISP_XS && left <= right && top >= 0 && bottom < DISP_XS && top <= bottom) {
		MaskL = left;
		MaskR = right;
		MaskT = top;
		MaskB = bottom;
	}
}



/*-----------------------------------------------------*/
/* Draw a solid rectangular                            */

void disp_rectfill (
	int left,		/* Left end (-32768..32767) */
	int right,		/* Right end (-32768..32767, >=left) */
	int top,		/* Top end (-32768..32767) */
	int bottom,		/* Bottom end (-32768..32767, >=top) */
	uint16_t color	/* Box color */
)
{
	uint32_t n;


	if (left > right || top > bottom) return; 	/* Check varidity */
	if (left > MaskR || right < MaskL  || top > MaskB || bottom < MaskT) return;	/* Check if in active area */

	if (top < MaskT) top = MaskT;		/* Clip top of rectangular if it is out of active area */
	if (bottom > MaskB) bottom = MaskB;	/* Clip bottom of rectangular if it is out of active area */
	if (left < MaskL) left = MaskL;		/* Clip left of rectangular if it is out of active area */
	if (right > MaskR) right = MaskR;	/* Clip right of rectangular if it is out of active area */

	disp_setrect(left, right, top, bottom);
	n = (uint32_t)(right - left + 1) * (uint32_t)(bottom - top + 1);
	do { DATA_WPX(color); } while (--n);
}




/*-----------------------------------------------------*/
/* Draw a hollow rectangular                           */

void disp_rect (
	int left,		/* Left end (-32768..32767) */
	int right,		/* Right end (-32768..32767, >=left) */
	int top,		/* Top end (-32768..32767) */
	int bottom,		/* Bottom end (-32768..32767, >=right) */
	uint16_t color	/* Box color */
)
{
	disp_rectfill(left, left, top, bottom, color);
	disp_rectfill(right, right, top, bottom, color);
	disp_rectfill(left, right, top, top, color);
	disp_rectfill(left, right, bottom, bottom, color);
}



/*-----------------------------------------------------*/
/* Set current dot position for disp_lineto            */

void disp_moveto (
	int x,		/* X position (-32768..32767) */
	int y		/* Y position (-32768..32767) */
)
{
	LocX = x;
	LocY = y;
}



/*-----------------------------------------------------*/
/* Draw a line from current position                   */

void disp_lineto (
	int x,		/* X position for the line to (-32768..32767) */
	int y,		/* Y position for the line to (-32768..32767) */
	uint16_t col	/* Line color */
)
{
	int32_t xr, yr, xp, yp, xd, yd;
	int ctr;


	xd = x - LocX; xr = LocX << 16; LocX = x;
	yd = y - LocY; yr = LocY << 16; LocY = y;
	if (!xd || !yd) {
		disp_rectfill(x - xd, x, y - yd, y, col);
		return;
	}
	if ((xd < 0 ? 0 - xd : xd) >= (yd < 0 ? 0 - yd : yd)) {
		ctr = (xd < 0 ? 0 - xd : xd) + 1;
		yd = (yd << 16) / (xd < 0 ? 0 - xd : xd);
		xd = (xd < 0 ? -1 : 1) << 16;
	} else {
		ctr = (yd < 0 ? 0 - yd : yd) + 1;
		xd = (xd << 16) / (yd < 0 ? 0 - yd : yd);
		yd = (yd < 0 ? -1 : 1) << 16;
	}
	xr += 1 << 15;
	yr += 1 << 15;
	do {
		xp = xr >> 16; yp = yr >> 16;
		if (xp >= MaskL && xp <= MaskR && yp >= MaskT && yp <= MaskB) {
			CMD_WRB(DISP_TYPE ? 0x15 : 0x2A);	/* Set H position */
			DATA_WRB(xp); DATA_WRB(xp);
			CMD_WRB(DISP_TYPE ? 0x75 : 0x2B);	/* Set V position */
			DATA_WRB(yp); DATA_WRB(yp);
			CMD_WRB(DISP_TYPE ? 0x5C : 0x2C);	/* Write a pixel data */
			DATA_WPX(col);
		}
		xr += xd; yr += yd;
	} while (--ctr);

}



/*-----------------------------------------------------*/
/* Draw a line                                         */

void disp_line (
	int x1,		/* Start position X for the line (-32768..32767) */
	int y1,		/* Start position Y for the line (-32768..32767) */
	int x2,		/* End position X for the line (-32768..32767) */
	int y2,		/* End position Y for the line (-32768..32767) */
	uint16_t col	/* Line color */
)
{
	disp_moveto(x1, y1);
	disp_lineto(x2, y2, col);
}



/*-----------------------------------------------------*/
/* Copy image data to the display                      */

void disp_blt (
	int left,		/* Left end (-32768..32767) */
	int right,		/* Right end (-32768..32767, >=left) */
	int top,		/* Top end (-32768..32767) */
	int bottom,		/* Bottom end (-32768..32767, >=right) */
	const uint16_t *pat	/* Pattern data */
)
{
	int yc, xc, xl, xs;
	uint16_t pd;


	if (left > right || top > bottom) return; 	/* Check varidity */
	if (left > MaskR || right < MaskL  || top > MaskB || bottom < MaskT) return;	/* Check if in active area */

	yc = bottom - top + 1;			/* Vertical size */
	xc = right - left + 1; xs = 0;	/* Horizontal size and skip */

	if (top < MaskT) {		/* Clip top of source image if it is out of active area */
		pat += xc * (MaskT - top);
		yc -= MaskT - top;
		top = MaskT;
	}
	if (bottom > MaskB) {	/* Clip bottom of source image if it is out of active area */
		yc -= bottom - MaskB;
		bottom = MaskB;
	}
	if (left < MaskL) {		/* Clip left of source image if it is out of active area */
		pat += MaskL - left;
		xc -= MaskL - left;
		xs += MaskL - left;
		left = MaskL;
	}
	if (right > MaskR) {	/* Clip right of source image it is out of active area */
		xc -= right - MaskR;
		xs += right - MaskR;
		right = MaskR;
	}

	disp_setrect(left, right, top, bottom);	/* Set rectangular area to fill */
	do {	/* Send image data */
		xl = xc / 2;
		while (xl--) {
			pd = *pat++; DATA_WPX(pd);
			pd = *pat++; DATA_WPX(pd);
		}
		if (xc & 1) {
			pd = *pat++; DATA_WPX(pd);
		}
		pat += xs;
	} while (--yc);
}



/*-----------------------------------------------------*/
/* Set current character position for disp_putc        */

void disp_locate (
	int col,	/* Column position */
	int row		/* Row position */
)
{
	if (FontS) {	/* Pixel position is calcurated with size of single byte font */
		LocX = col * FontS[14];
		LocY = row * FontS[15];
#if USE_DBCS
		Sjis = 0;
#endif
	}
}



/*-----------------------------------------------------*/
/* Register text font                                  */

void disp_font_face (
	const uint8_t *font	/* Pointer to the font structure in FONTX2 format */
)
{
	if (!memcmp(font, "FONTX2", 6)) {
#if USE_DBCS
		if (font[16] != 0)
			FontD = font;
		else
#endif
			FontS = font;
	}
}



/*-----------------------------------------------------*/
/* Set current text color                              */

void disp_font_color (
	uint32_t color	/* (bg << 16) + fg */
)
{
	ChrColor = color;
}



/*-----------------------------------------------------*/
/* Put a text character                                */

void disp_putc (
	uint8_t chr		/* Character to be output (kanji chars are given in two disp_putc sequence) */
)
{
	const uint8_t *fnt;;
	uint8_t b, d;
	uint16_t dchr;
	uint32_t col;
	int h, wc, w, wb, i, fofs;


